{
  "jobs": [
    {
      "id": "product-analyst",
      "title": "Product Analyst",
      "location": "📍 Chicago, IL",
      "salary": "$75,000 — $95,000",
      "description": "Analyze product metrics and help drive roadmap decisions.",
      "fullDescription": "As a Product Analyst you'll partner with product managers and engineers to turn data into actionable insights. You will build dashboards, run experiments, and surface trends that inform prioritization and product improvements.\n\nThe ideal candidate has strong SQL skills, experience with analytics tools, and a curiosity for user behaviour. Clear communication and the ability to present findings to cross-functional teams are essential."
    },
    {
      "id": "data-scientist",
      "title": "Data Scientist",
      "location": "📍 Boston, MA",
      "salary": "$120,000 — $150,000",
      "description": "Develop models and insights to improve core product metrics.",
      "fullDescription": "Join our analytics team to design and deploy machine learning models that improve personalization and user retention. You will collaborate with engineering to productionize models and monitor performance.\n\nWe value experience in supervised learning, experimentation, and a solid foundation in statistics. Strong Python skills and familiarity with cloud ML services are a plus."
    },
    {
      "id": "devops-engineer",
      "title": "DevOps Engineer",
      "location": "📍 Remote",
      "salary": "$105,000 — $135,000",
      "description": "Build and maintain CI/CD pipelines and cloud infrastructure.",
      "fullDescription": "The DevOps Engineer will improve deployment velocity and reliability across our microservices. Responsibilities include automating infrastructure, enhancing monitoring, and optimizing cost and performance in the cloud.\n\nCandidates should have experience with container orchestration, infrastructure-as-code, and observability tooling. Strong scripting skills and a security-minded approach are important."
    },
    {
      "id": "ux-researcher",
      "title": "UX Researcher",
      "location": "📍 Seattle, WA",
      "salary": "$90,000 — $115,000",
      "description": "Conduct qualitative and quantitative research to inform product design.",
      "fullDescription": "As a UX Researcher you'll plan and run studies to understand user needs and validate design decisions. You'll synthesize findings into clear recommendations for product and design teams.\n\nExperience with usability testing, interview techniques, and mixed-method research is preferred. You should be adept at turning research into practical product guidance."
    }
  ]
}
